; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v11 ?v4)
             (pred_3 ?v5 ?v9)
             (pred_7 ?v11 ?v9)
             (pred_5 ?v3 ?v11 )
	     (pred_10 ?v11)
             (pred_6 ?v7)
             (pred_11 ?v5)
             (pred_1 ?v9)
             (pred_12 ?v11)
             (pred_2 ?v5)
             (pred_9 ?v11)
             (pred_8 ))



(:action op_3
:parameters (?v12 ?v6 ?v2 ?v1)
:precondition (and (pred_6 ?v12) (pred_6 ?v6) (pred_11 ?v2) (pred_1 ?v1)
          (pred_4 ?v12 ?v6) (pred_3 ?v2 ?v1)
                   (pred_7 ?v6 ?v1) (pred_10 ?v12) 
                   (pred_12 ?v6) (pred_2 ?v2))
:effect (and  (pred_9 ?v6) (not (pred_12 ?v6))))


(:action op_5
:parameters (?v12 ?v10)
:precondition (and (pred_6 ?v12) (pred_6 ?v10)
               (pred_10 ?v12) (pred_4 ?v12 ?v10) (pred_9 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v12))))

(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_6 ?v12) (pred_11 ?v2) 
                  (pred_10 ?v12) (pred_5 ?v2 ?v12) (pred_8 ))
:effect (and (pred_2 ?v2)
   (not (pred_5 ?v2 ?v12)) (not (pred_8 ))))


(:action op_4
:parameters (?v12 ?v13 ?v8)
:precondition (and (pred_6 ?v12) (pred_11 ?v13) (pred_11 ?v8)
                  (pred_10 ?v12) (pred_2 ?v8) (pred_5 ?v13 ?v12))
:effect (and (pred_2 ?v13) (pred_5 ?v8 ?v12)
        (not (pred_2 ?v8)) (not (pred_5 ?v13 ?v12))))

(:action op_1
:parameters (?v12 ?v2)
:precondition (and (pred_6 ?v12) (pred_11 ?v2) 
                  (pred_10 ?v12) (pred_2 ?v2))
:effect (and (pred_8 ) (pred_5 ?v2 ?v12) (not (pred_2 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_12 obj_27 obj_19 obj_16 obj_22 obj_20 obj_14 obj_25 obj_15 obj_17 obj_08 obj_05 obj_26 obj_02 obj_11 obj_31 obj_29 obj_13 obj_21 obj_01 obj_23 obj_06 obj_04 obj_10
    obj_18 obj_28 obj_09
    obj_07 obj_03 obj_24
    )

    (:init
       (pred_8)

       (pred_6 obj_30)
       (pred_6 obj_12)
       (pred_6 obj_27)
       (pred_6 obj_19)
       (pred_6 obj_16)
       (pred_6 obj_22)
       (pred_6 obj_20)
       (pred_6 obj_14)
       (pred_6 obj_25)
       (pred_6 obj_15)
       (pred_6 obj_17)
       (pred_6 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_26)
       (pred_6 obj_02)
       (pred_6 obj_11)
       (pred_6 obj_31)
       (pred_6 obj_29)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_01)
       (pred_6 obj_23)
       (pred_6 obj_06)
       (pred_6 obj_04)
       (pred_6 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_28)
       (pred_1 obj_09)
       (pred_11 obj_07)
       (pred_11 obj_03)
       (pred_11 obj_24)

       (pred_4 obj_30 obj_22)
       (pred_4 obj_30 obj_12)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_27)
       (pred_4 obj_12 obj_30)
       (pred_4 obj_27 obj_14)
       (pred_4 obj_27 obj_19)
       (pred_4 obj_27 obj_12)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_27)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_22 obj_17)
       (pred_4 obj_22 obj_20)
       (pred_4 obj_22 obj_30)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_22)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_14 obj_25)
       (pred_4 obj_14 obj_27)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_25 obj_26)
       (pred_4 obj_25 obj_15)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_25 obj_14)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_25)
       (pred_4 obj_17 obj_11)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_17 obj_22)
       (pred_4 obj_08 obj_31)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_05 obj_29)
       (pred_4 obj_05 obj_26)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_26 obj_13)
       (pred_4 obj_26 obj_02)
       (pred_4 obj_26 obj_25)
       (pred_4 obj_26 obj_05)
       (pred_4 obj_02 obj_21)
       (pred_4 obj_02 obj_15)
       (pred_4 obj_02 obj_26)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_31)
       (pred_4 obj_11 obj_17)
       (pred_4 obj_31 obj_23)
       (pred_4 obj_31 obj_29)
       (pred_4 obj_31 obj_08)
       (pred_4 obj_31 obj_11)
       (pred_4 obj_29 obj_06)
       (pred_4 obj_29 obj_13)
       (pred_4 obj_29 obj_05)
       (pred_4 obj_29 obj_31)
       (pred_4 obj_13 obj_04)
       (pred_4 obj_13 obj_21)
       (pred_4 obj_13 obj_26)
       (pred_4 obj_13 obj_29)
       (pred_4 obj_21 obj_10)
       (pred_4 obj_21 obj_02)
       (pred_4 obj_21 obj_13)
       (pred_4 obj_01 obj_23)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_23 obj_06)
       (pred_4 obj_23 obj_31)
       (pred_4 obj_23 obj_01)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_29)
       (pred_4 obj_06 obj_23)
       (pred_4 obj_04 obj_10)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_10 obj_21)
       (pred_4 obj_10 obj_04)
       (pred_12 obj_21)
       (pred_12 obj_25)
       (pred_12 obj_27)
       (pred_7  obj_21 obj_18)
       (pred_7  obj_25 obj_28)
       (pred_7  obj_27 obj_09)
       (pred_9 obj_30)
       (pred_9 obj_12)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_22)
       (pred_9 obj_20)
       (pred_9 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_26)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_31)
       (pred_9 obj_29)
       (pred_9 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_23)
       (pred_9 obj_06)
       (pred_9 obj_04)
       (pred_9 obj_10)

       (pred_3  obj_07 obj_18)
       (pred_3  obj_03 obj_28)
       (pred_3  obj_24 obj_09)
       (pred_5 obj_07 obj_29)
       (pred_5 obj_03 obj_08)
       (pred_5 obj_24 obj_23)
       (pred_10 obj_22)
    )

    (:goal (and
       (pred_5 obj_07 obj_15)
       (pred_5 obj_03 obj_25)
    ))
(:constraints
  (always (not (pred_10 obj_20)))
)
)

; plan
1. (op_5 obj_22 obj_17)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_17)
   goals met: 0 of 2
2. (op_5 obj_17 obj_08)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_08)
   goals met: 0 of 2
3. (op_5 obj_08 obj_05)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_05)
   goals met: 0 of 2
4. (op_5 obj_05 obj_29)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_29)
   goals met: 0 of 2
5. (op_2 obj_29 obj_07)
   deleted: (pred_5 obj_07 obj_29) (pred_8)
   added: (pred_2 obj_07)
   goals met: 0 of 2
6. (op_5 obj_29 obj_05)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_05)
   goals met: 0 of 2
7. (op_5 obj_05 obj_08)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_08)
   goals met: 0 of 2
8. (op_4 obj_08 obj_03 obj_07)
   deleted: (pred_2 obj_07) (pred_5 obj_03 obj_08)
   added: (pred_2 obj_03) (pred_5 obj_07 obj_08)
   goals met: 0 of 2
9. (op_5 obj_08 obj_05)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_05)
   goals met: 0 of 2
10. (op_5 obj_05 obj_14)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_14)
   goals met: 0 of 2
11. (op_3 obj_14 obj_25 obj_03 obj_28)
   deleted: (pred_12 obj_25)
   added: (pred_9 obj_25)
   goals met: 0 of 2
12. (op_5 obj_14 obj_25)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_25)
   goals met: 0 of 2
13. (op_1 obj_25 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_8) (pred_5 obj_03 obj_25)
   goals met: 1 of 2
14. (op_5 obj_25 obj_14)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_14)
   goals met: 1 of 2
15. (op_5 obj_14 obj_05)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_05)
   goals met: 1 of 2
16. (op_5 obj_05 obj_08)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_08)
   goals met: 1 of 2
17. (op_2 obj_08 obj_07)
   deleted: (pred_5 obj_07 obj_08) (pred_8)
   added: (pred_2 obj_07)
   goals met: 1 of 2
18. (op_5 obj_08 obj_05)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_05)
   goals met: 1 of 2
19. (op_5 obj_05 obj_14)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_14)
   goals met: 1 of 2
20. (op_5 obj_14 obj_25)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_25)
   goals met: 1 of 2
21. (op_5 obj_25 obj_15)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_15)
   goals met: 1 of 2
22. (op_1 obj_15 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_8) (pred_5 obj_07 obj_15)
   goals met: 2 of 2
